
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * module.bar-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights.azurerm_application_insights.this must be replaced
  # (moved from azurerm_application_insights.appinsights)
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "4b4cf17b-2f13-4bee-bc1e-7f91e72fa3c5" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bar-aat-rg/providers/Microsoft.Insights/components/bar-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "westeurope" -> "uksouth" # forces replacement
        name                                  = "bar-aat"
      ~ tags                                  = {
          + "application"         = "fees-and-payments"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/bar-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "staging"
          + "managedBy"           = "Fees/Pay"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" # forces replacement
        # (9 unchanged attributes hidden)

      - timeouts {}
    }

  # module.bar-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bar-aat-rg/providers/Microsoft.KeyVault/vaults/bar-aat|bar-aat"
        name                           = "bar-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":35,"Program":"tfcmt","SHA1":"","Vars":{}} -->